import type { I18nAdmin } from './interface.ts';

export let I18nAdminRu: I18nAdmin = {
    api_key: {
        delete1: 'Вы уверены, что хотите удалить этот API-ключ?',
        expires: 'Срок действия',
        generate1: 'Здесь вы можете сгенерировать новый секрет для этого API-ключа.',
        generate2: `Вы увидите этот секрет только один раз после генерации.
            При генерации нового секрета старый будет перезаписан навсегда.
            Эту операцию нельзя отменить!`,
        generate3: `API-ключ должен быть передан в HTTP-заголовке <code>Authorization</code>
            в следующем формате:`,
        generate4:
            'Вы можете использовать следующий запрос <code>curl</code> для проверки вашего нового ключа:',
        generate5: 'Если у вас не установлен <code>jq</code> и предыдущая команда не работает:',
        keyName: 'Имя ключа',
        limitedValidity: 'Ограниченный срок действия',
    },
    attrs: {
        delete1: 'Вы уверены, что хотите удалить этот атрибут?',
        defaultValue: 'Значение по умолчанию',
        desc: 'Описание',
        makeEditable: 'Сделать редактируемым',
        makeEditableP1:
            'Вы можете преобразовать этот атрибут и сделать его редактируемым самими пользователями.',
        makeEditableP2: `<b>ВНИМАНИЕ:</b> Это действие нельзя отменить! Все данные, введённые пользователем напрямую, всегда
            являются ненадёжными и НИКОГДА НЕ ДОЛЖНЫ использоваться для любой формы аутентификации или авторизации!`,
        makeEditableP3: `Атрибут нельзя изменить с редактируемого на нередактируемый, потому что он допускал ненадёжные
            входные данные в прошлом, независимо от того, как долго это продолжалось.`,
        name: 'Имя атрибута',
        userEditable: 'Редактируемый пользователем',
    },
    backup: {
        createBackup: 'Создать резервную копию',
        disabledDesc:
            'Эта функция доступна только при использовании Hiqlite в качестве базы данных.',
        lastModified: 'Последнее изменение',
        local: 'Локальная',
        name: 'Имя',
        size: 'Размер',
    },
    clients: {
        backchannelLogout:
            'Если этот клиент поддерживает {{ OIDC_BCL }}, вы можете указать URI здесь.',
        branding: {
            descHsl: `Следующие значения должны быть указаны в формате HSL. Вы задаёте только базовые цвета.
            Альфа-каналы и другие значения динамически изменяются темой.`,
            descFullCss: `Следующие значения должны быть полностью допустимыми CSS-значениями <code>color</code>.
                Вы также можете использовать сложные вычисления или определённые выше CSS-переменные.`,
            descVariables: `Каждая следующая метка одновременно является именем CSS-переменной. Это означает,
                что вы можете ссылаться на них в свободных полях ввода, например, с помощью <code>hsla(var(--action) / .7)</code>.`,
        },
        confidential: 'Конфиденциальный',
        confidentialNoSecret: 'Это неконфиденциальный клиент, поэтому у него нет секрета.',
        config: 'Конфигурация клиента',
        delete1: 'Вы уверены, что хотите удалить этот клиент?',
        descAuthCode: `Срок действия кодов авторизации можно настроить для повышения безопасности. Коды авторизации
            могут быть использованы только один раз и по умолчанию действительны 60 секунд. Чем короче срок действия, тем
            лучше, при условии что клиент может выполнить процедуру входа достаточно быстро.`,
        descClientUri: `Информация об URI этого клиента и контактах для отображения на
            странице входа.`,
        descName: `Имя клиента можно изменить без влияния на конфигурацию клиента.
            Оно существует только для отображения на странице входа.`,
        descGroupPrefix: `Вход для этого клиента может быть ограничен необязательным префиксом группы.
            Только пользователи, назначенные в соответствующую группу, смогут выполнить вход.`,
        descOrigin: `Внешние, дополнительно разрешённые источники — обычно необходимы, только если этот клиент
            должен выполнять запросы к Rauthy напрямую из браузера, как правило, SPA.`,
        descPKCE: `Если клиент поддерживает это, вы всегда должны активировать S256 PKCE для дополнительной
            безопасности. Если используется неконфиденциальный клиент (например, SPA), вы должны активировать
            хотя бы одну из проверок PKCE для обеспечения достаточной безопасности.`,
        descPKCEEnforce: `Если активирован любой PKCE, Rauthy будет принудительно требовать его использование при входе и
            отклонять запросы на вход, не содержащие допустимого вызова.`,
        descUri: `Вы можете указать любое количество URI перенаправления. В конце каждого можно использовать
            <code>*</code> в качестве подстановочного символа.`,
        errConfidentialPKCE: `Клиент должен быть либо конфиденциальным, либо иметь активированную хотя бы одну
            проверку PKCE.`,
        forceMfa: 'Принудительная MFA',
        groupLoginPrefix: 'Префикс группы для входа',
        name: 'Имя клиента',
        scim: {
            baseUri: `Базовый URI SCIM — это URI, от которого могут быть правильно получены подмаршруты, такие как
                <code>{base_uri}/Users/{id}</base_uri></code>.`,
            desc: 'Если этот клиент поддерживает {{ SCIM_LINK }}, вы можете активировать это здесь.',
            enable: 'Включить SCIMv2',
            groupSync: 'Синхронизация групп',
            groupSyncPrefix: 'Префикс фильтра групп',
            groupSyncPrefixDesc: `Вы можете фильтровать группы для синхронизации по необязательному префиксу.
                Например, если существуют группы <code>app:admins</code> и <code>app:users</code>, префикс
                 <code>app:</code> будет синхронизировать только эти группы, а также только тех пользователей, которые связаны хотя бы
                 с одной из этих групп.`,
            reqDesc: 'Для совместимости необходимо выполнение нескольких условий:',
            reqLi1: 'Клиент должен корректно обрабатывать <code>externalId</code>.',
            reqLi2: `Как минимум должны поддерживаться эндпоинты <code>/Users</code> с <code>filter=externalId eq "*"</code> и
                <code>filter=userName eq "*"</code>.`,
            reqLi3: `Если группы должны быть синхронизированы, <code>/Groups</code> также должен поддерживать
                <code>filter=displayName eq "*"</code>.`,
        },
        scopes: {
            allowed: 'Разрешённые области',
            default: 'Области по умолчанию',
            desc: `Разрешённые области — это те, которые клиент может динамически запрашивать при
            перенаправлении на страницу входа при использовании потока <code>authorization_code</code>. Области
            по умолчанию всегда добавляются к токенам для решения некоторых проблем при использовании,
            например, <code>password</code>.`,
        },
        secret: {
            doCache: 'Кэшировать секрет клиента',
            cacheDuration: 'Длительность кэширования (часы)',
            generate: 'Сгенерировать новый секрет',
            rotateDesc1: `Для обеспечения плавных обновлений и ротации секретов вы можете сохранить текущий
                секрет в кэше в памяти на некоторое время. Вы можете указать значение от 1 до 24 часов.`,
            rotateDesc2: 'Внимание: Не кэшируйте текущий секрет, если произошла утечка!',
        },
        tokenLifetime: {
            p1: `Время жизни токена применяется к токенам доступа и ID-токенам и указывается в секундах.`,
            p2: `Если клиент поддерживает алгоритмы EdDSA / ed25519, они всегда должны быть предпочтительным
                выбором. Алгоритмы RSA существуют только для совместимости.`,
            p3: `Алгоритм для токенов обновления нельзя изменить, так как они используются только Rauthy.`,
        },
    },
    common: {
        account: 'Аккаунт',
        addNew: 'Добавить',
        back: 'Назад',
        caution: 'ВНИМАНИЕ',
        contact: 'Контакт',
        copiedToClip: 'Значение скопировано в буфер обмена',
        details: 'Подробности',
        edit: 'Редактировать',
        enabled: 'Включено',
        filter: 'Фильтр',
        from: 'От',
        information: 'Информация',
        language: 'Язык',
        loading: 'Загрузка',
        jsonMeta: 'Метаданные в формате JSON',
        name: 'Имя',
        nameExistsAlready: 'Имя уже существует',
        note: 'Примечание',
        noEntries: 'Нет записей',
        preview: 'Предпросмотр',
        reset: 'Сбросить',
        searchOptions: 'Параметры поиска',
        until: 'До',
    },
    docs: {
        book: 'Для общей документации о Rauthy ознакомьтесь с',
        encryption: 'Шифрование',
        encKeys: {
            header: 'Ключи шифрования',
            keyActive: 'Активный ключ',
            keysAvailable: 'Доступные ключи',
            migrate: 'Мигрировать',
            migrateToKey: 'Мигрировать все существующие зашифрованные значения на следующий ключ',
            p1: `Эти ключи используются для дополнительного шифрования при хранении, независимо от используемой технологии
            хранения данных. Они настраиваются статически, но могут быть ротированы и мигрированы на этой странице вручную.`,
            p2: `Активный ключ задаётся статически в конфигурационном файле Rauthy / переменных окружения. Его нельзя изменить
            здесь динамически. Все новые шифрования JWK всегда будут использовать текущий активный ключ.`,
            p3: `Если вы мигрируете все существующие секреты, это может занять несколько секунд при большом
            наборе данных.`,
            pNotPossible:
                'Для выполнения миграции необходимо наличие как минимум 2 ключей шифрования.',
        },
        hashing: {
            calculate: 'Вычислить',

            currValuesHead: 'Текущие значения',
            currValues1: 'Текущие значения из бэкенда следующие:',
            currValuesNote: `Примечание: Время входа из бэкенда даёт хорошее руководство только после как минимум 5
            успешных входов после запуска Rauthy. Базовое значение всегда составляет 2000 мс после свежего перезапуска
            и корректируется со временем при каждом успешном входе.`,
            currValuesThreadsAccess: 'Потоков (p_cost) доступно для Rauthy',

            loginTimeHead: 'О времени входа',
            loginTime1: `Как правило, пользователи хотят, чтобы всё работало как можно быстрее. Однако при безопасном входе время
            от 500 до 1000 мс не должно быть проблемой. Время входа не должно быть слишком коротким, так как это снизит
            надёжность хеша.`,
            loginTime2: `Для обеспечения максимальной безопасности по умолчанию эта утилита не позволяет установить время входа
            менее 500 мс.`,

            mCost1: `<code>m_cost</code> определяет объём <b>памяти (в кБ)</b>, используемой для хеширования.
            Чем выше значение, тем лучше, конечно. Но нужно учитывать ресурсы сервера.<br>
            Когда вы хешируете 4 пароля одновременно, например, бэкенду требуется <code>4 x m_cost</code>
            во время хеширования. Эти ресурсы должны быть доступны.`,
            mCost2: `Настройка <code>m_cost</code> довольно проста. Определите максимальный объём памяти, который Rauthy должен использовать,
            разделите его на количество максимально допустимых параллельных входов (<code>MAX_HASH_THREADS</code>) и вычтите небольшой
            статический объём памяти. Сколько статической памяти следует учитывать, зависит от используемой базы данных
            и общего количества пользователей, но обычно составляет от 32 до 96 МБ.`,
            mCost3: 'Минимально допустимое значение <code>m_cost</code> — <code>32768</code>.',

            pCost1: `<code>p_cost</code> определяет степень <b>параллелизма</b> при хешировании. Это значение чаще всего
            достигает максимума при ~8, что является значением по умолчанию для Rauthy.`,
            pCost2: `Общее правило:<br>
            Установите <code>p_cost</code> в два раза больше количества доступных ядер.<br>
            Например, если у вас 4 ядра, установите <code>p_cost</code> на <code>8</code>.<br>
            Однако это значение должно учитывать настроенное количество допустимых параллельных входов (<code>MAX_HASH_THREADS</code>)
            и быть соответственно уменьшено.`,

            tCost1: `<code>t_cost</code> определяет количество <b>времени</b> для хеширования. Это единственное
            значение, которое требует настройки, так как <code>m_cost</code> и <code>p_cost</code> фактически определяются
            средой.`,
            tCost2: `Настройка проста: установите <code>m_cost</code> и <code>p_cost</code> соответственно, а затем увеличивайте
            <code>t_cost</code> до тех пор, пока не достигнете желаемого времени хеширования.`,

            utilityHead: 'Утилита расчёта параметров',
            utility1: `Вы можете использовать этот инструмент для приблизительного определения оптимальных значений для вашего развёртывания. Имейте в виду, что это
            должно выполняться с Rauthy на его конечном месте со всеми доступными конечными ресурсами. Утилиту следует запускать
            под нагрузкой, чтобы не переоптимизировать.`,
            utility2: `<code>m_cost</code> является необязательным, и безопасное минимальное значение <code>32768</code> будет выбрано,
            если оставить пустым. <code>p_cost</code> также необязателен, и Rauthy задействует все потоки, которые он видит, если оставить пустым.`,

            time: 'Время',
            targetTime: 'Целевое время',
            tune: 'Важно: Эти значения необходимо настраивать на конечной архитектуре!',
            pDetials: `Если вам нужно подробное введение в Argon2ID, в интернете доступно множество источников. Это руководство даёт
            лишь очень краткий обзор значений. Необходимо настроить три из них:`,
            pTune: `Они изменяются в зависимости от возможностей системы. Чем мощнее система, тем более безопасные
            значения можно установить.`,
            pUtility: `Эта утилита поможет вам найти лучшие настройки Argon2ID для вашей платформы.
            Argon2ID — это на данный момент самый безопасный алгоритм хеширования паролей. Чтобы использовать его на полную мощность,
            его необходимо настроить для каждого развёртывания.`,
        },
        openapi:
            'Если вы хотите интегрировать внешнее приложение и использовать API Rauthy, ознакомьтесь с',
        openapiNote: `В зависимости от конфигурации бэкенда, Swagger UI может быть недоступен публично в данный момент.
            Однако по умолчанию он доступен через внутренний HTTP-сервер метрик, чтобы не раскрывать
            информацию.`,
        source: 'Исходный код можно найти здесь',
    },
    editor: {
        bold: 'Жирный',
        code: 'Код',
        heading1: 'Заголовок 1',
        heading2: 'Заголовок 2',
        heading3: 'Заголовок 3',
        italic: 'Курсив',
        link: 'Ссылка',
        listBullet: 'Список',
        listTasks: 'Задачи',
        listNumbered: 'Нумерованный список',
        paragraph: 'Абзац',
        quote: 'Цитата',
        removeFmt: 'Убрать форматирование',
        strikeThrough: 'Зачёркнутый',
        textArea: 'Редактировать текст',
    },
    email: {
        cancelJob: 'Отменить задание',
        filterType: ['Нет', 'В группе', 'Не в группе', 'Имеет роль', 'Не имеет роли'],
        immediate: 'Немедленно',
        jobs: 'Задания E-Mail',
        scheduled: 'Запланированная отправка',
        sendAllUsers: 'Это письмо будет отправлено всем пользователям.',
        sendAllUsersFiltered: 'Это письмо будет отправлено всем пользователям с фильтром:',
        sendMail: 'Отправить E-Mail',
        subject: 'Тема',
        userFilter: 'Фильтр пользователей',
    },
    error: {
        needsAdminRole: `Вам не назначена роль <b>rauthy_admin</b>.<br/>
            У вас нет доступа к панели администратора.`,
        noAdmin: `Учётная запись администратора Rauthy должна иметь <b>включённую MFA.</b><br>
            Пожалуйста, перейдите в свой <b>аккаунт</b> и активируйте MFA.<br>
            После этого необходимо выйти и войти снова.`,
    },
    events: {
        eventLevel: 'Уровень события',
        eventType: 'Тип события',
    },
    groups: {
        delete1: 'Вы уверены, что хотите удалить эту группу?',
        name: 'Имя группы',
    },
    jwks: {
        alg: 'Алгоритм',
        p1: 'Это JSON Web Keys (JWK), используемые для подписи токенов.',
        p2: `JWK ротируются по умолчанию каждое 1-е число месяца. Для всех вновь созданных токенов используется только последний
        доступный ключ для данного алгоритма. Старые ключи сохраняются некоторое время, чтобы гарантировать,
        что действующие токены могут быть правильно проверены. Через некоторое время они будут автоматически
        очищены.`,
        p3: `Ключи также можно ротировать вручную. В зависимости от оборудования, на котором работает этот экземпляр Rauthy, это может
        занять несколько секунд.`,
        type: 'Тип',
        rotateKeys: 'Ротировать ключи',
    },
    kv: {
        accessTestDesc: `Ключ доступа должен быть передан в заголовке <code>Authorization</code> как
            токен <code>Bearer</code>. Для тестирования можно использовать следующую команду
            <code>curl</code>.`,
        addNewKey: 'Новый ключ доступа',
        addNewNs: 'Новое пространство имён',
        addNewValue: 'Новое значение',
        delConfirm: 'Вы действительно хотите удалить этот ключ доступа?',
        delNsMsg:
            'Вы действительно хотите удалить это пространство имён со всеми существующими данными?',
        encryptedDesc: `По соображениям производительности дополнительное шифрование следует использовать только для
            особо чувствительных значений, таких как ключи доступа или персональные данные.`,
        deleteConfirmMsg: `Вы действительно хотите удалить ключ '{{ key }}'?`,
        help: {
            help: 'Помощь',
            ops: [
                'Проверить ключ доступа',
                'Получить все существующие ключи',
                'Получить все существующие ключи + значения',
                'Установить ключ + значение',
                'Получить значение по ключу',
                'Удалить ключ',
            ],
            p1: `Внешний доступ к KV-хранилищам намеренно сделан очень простым. Доступно лишь
                несколько операций:`,
            p2: `Каждая из этих операций требует ключ доступа в виде токена <code>Bearer</code>
                (<code>{id}\${secret}</code>) в заголовке <code>Authorization</code>. Ключ доступа
                действителен только для того пространства имён, в котором он существует.`,
            p3: `Здесь вы увидите примеры для вышеупомянутых операций с использованием
                <code>curl</code>.`,
        },
        key: 'Ключ',
        loadAllValues: 'Загрузить все значения',
        storeEncrypted: 'Хранить значение в зашифрованном виде',
        tabs: ['Данные', 'Доступ', 'Редактирование', 'Удаление'],
        testCmd: 'Тестовая команда',
        value: 'JSON-значение',
    },
    nav: {
        apiKeys: 'API-ключи',
        attributes: 'Атрибуты',
        blacklist: 'Чёрный список',
        clients: 'Клиенты',
        config: 'Конфигурация',
        docs: 'Документация',
        events: 'События',
        groups: 'Группы',
        providers: 'Провайдеры',
        roles: 'Роли',
        scopes: 'Области',
        sessions: 'Сессии',
        users: 'Пользователи',
    },
    options: {
        expires: 'Истекает',
        lastSeen: 'Последняя активность',
        state: 'Состояние',
    },
    pam: {
        addGroup: 'Новая PAM-группа',
        addHost: 'Новый PAM-хост',
        addUser: 'Новый PAM-пользователь',
        deleteHost: 'Вы действительно хотите удалить этот хост?',
        groupDescGeneric: `Общие группы являются аналогом записей, которые обычно находятся в /etc/group. Пользователи
            могут быть назначены в них, и они возвращаются системе при NSS-запросах.`,
        groupDescHost: `Группы хостов используются для группировки хостов. NSS-запросы хоста внутри группы возвращают все остальные
            хосты в ней в качестве результата. Пользователи могут получить доступ к хостам, будучи назначенными в группу хостов.`,
        groupDescLocal: `Локальные группы ведут себя почти идентично общим группам, с той разницей, что они имеют
            ID в базе данных Rauthy, но NSS-прокси на соответствующем хосте преобразует его в ID из
            /etc/group. Таким образом, пользователи Rauthy могут быть назначены в группы, которые уже существуют локально.`,
        groupDescUser: `Пользовательские группы управляются автоматически и тесно связаны с пользователем с тем же
            именем.`,
        groupDescWheel: `Эта группа особая. Она неизменяема и назначается пользователям динамически в зависимости от их
            конфигурации групп.`,
        groupName: 'Имя группы',
        groups: 'Группы',
        groupType: 'Тип группы',
        hostAliases: 'Псевдонимы хоста',
        hostLocalPwdOnly: 'Локальный вход по паролю',
        hostLocalPwdOnlyInfo: `Когда установлен локальный вход по паролю, он переопределяет принудительную MFA для локальных входов. В то же
            время ключи доступа никогда не запрашиваются (локально) при входе, даже если пользователь защищён MFA. Эту опцию
            следует устанавливать только при необходимости, например, если пользователи с MFA должны иметь возможность выполнять локальный вход
            без использования аппаратных ключей доступа.`,
        ipAddresses: 'IP-адреса',
        member: 'Участник',
        nameExistsAlready: 'Имя уже занято',
        notes: 'Заметки',
        secretShow: 'Показать секрет',
        secretRotate: 'Ротировать секрет',
        userEmail: 'Привязанный E-Mail пользователя',
        username: 'Имя пользователя',
        usernameNewDesc: `Имя пользователя следует выбирать тщательно. После создания его нельзя легко изменить
            по соображениям безопасности.`,
    },
    passwordPolicy: {
        configDesc: 'Политика для новых паролей.',
        resetSet0: 'Значение 0 деактивирует требование.',
        validForDays: 'Действителен дней',
        validityNew: 'Срок действия для новых паролей.',
    },
    providers: {
        config: {
            allowInsecureTls: 'Разрешить небезопасный TLS',
            autoLink: 'Автопривязка пользователя',
            autoLinkDesc1: `Если автопривязка пользователя активирована, вход через этого провайдера автоматически привяжет
                возможно существующего, непривязанного пользователя к этому провайдеру.`,
            autoLinkDesc2: `ВНИМАНИЕ: Эта опция может быть очень опасной и привести к захвату аккаунта, если провайдер
                не полностью проверяет адреса электронной почты пользователей и, следовательно, позволяет добавить чужой
                адрес для пользователя! НИКОГДА НЕ должна использоваться в таком случае!`,
            clientName: 'Имя клиента',
            custRootCa: 'Пользовательский корневой CA PEM',
            descAuthMethod: `Метод аутентификации для использования на эндпоинте <code>/token</code>.<br>
                Большинство провайдеров работают с <code>basic</code>, некоторые только с <code>post</code>.
                В редких случаях нужны оба, в то время как у других это может вызвать ошибки.`,
            descClientId: 'ID клиента, предоставленный провайдером аутентификации.',
            descClientName: 'Имя клиента, которое должно отображаться на странице входа Rauthy.',
            descClientSecret: `Секрет клиента, предоставленный провайдером аутентификации.
                Требуется как минимум секрет клиента или PKCE.`,
            descScope: `Область, которую клиент должен использовать при перенаправлении на вход.
                Укажите значения через пробел.`,
            errNoAuthMethod:
                'Вы указали секрет клиента, но ни один метод аутентификации клиента не активен',
            errConfidential:
                'Должен быть как минимум конфиденциальным клиентом или использовать PKCE',
            jsonPath: {
                p1: 'Значения из ID-токена после успешного входа через вышестоящего провайдера могут быть сопоставлены автоматически.',
                p2: `<code>path</code> должен быть задан в синтаксисе, подобном регулярным выражениям. Он может разрешаться в
                    одиночные JSON-значения или в значение внутри JSON-объекта или массива.`,
                p3: '<code>$.</code> обозначает начало JSON-объекта',
                p4: '<code>*</code> может использоваться как подстановочный символ в вашем пути',
                p5: '<code>$.roles</code> будет нацелен на <code>&#123;"roles": "value"&#125;</code>',
                p6: `<code>$.roles.*</code> может быть нацелен на значение внутри объекта или массива, например<br>
                    <code>&#123;"roles": ["value", "notMyValue"]&#125;</code>`,
            },
            lookup: 'Поиск',
            pathAdminClaim: 'Путь к утверждению администратора',
            pathMfaClaim: 'Путь к утверждению MFA',
            rootPemCert: 'Корневой PEM-сертификат',
            mapMfa: `Если ваш провайдер выдаёт утверждение, указывающее, что пользователь использовал как минимум 2FA при
                входе, вы можете указать путь к утверждению MFA.`,
            mapUser: `Вы можете назначить пользователю роль администратора Rauthy на основе утверждения вышестоящего ID.`,
            valueAdminClaim: 'Значение утверждения администратора',
            valueMfaClaim: 'Значение утверждения MFA',
        },
        delete: {
            areYouSure: 'Вы уверены, что хотите удалить этого провайдера?',
            forceDelete: 'Принудительное удаление',
            isInUse1: 'Этот провайдер используется активными пользователями!',
            isInUse2: `Вы можете принудительно удалить его, но пользователи без локального пароля или ключа доступа
                больше не смогут войти в систему.`,
            linkedUsers: 'Связанные пользователи',
        },
    },
    roles: {
        adminNoMod: 'Роль <code>rauthy_admin</code> является неизменяемой.',
        delete1: 'Вы уверены, что хотите удалить эту роль?',
        name: 'Имя роли',
    },
    scopes: {
        defaultNoMod: 'Это стандартная область OIDC. Стандартные области неизменяемы.',
        delete1: 'Вы уверены, что хотите удалить эту область?',
        deleteDefault: 'Стандартные области OIDC нельзя удалить.',
        mapping1: 'Вы можете сопоставить пользовательские области с атрибутами.',
        mapping2: `Все дополнительные атрибуты, которые были настроены, могут иметь пользовательское значение для каждого пользователя.
            Когда они сопоставлены с областью, они могут быть включены в токены доступа и/или ID-токены.`,
        name: 'Имя области',
    },
    search: {
        orderBy: 'Сортировать по ...',
        orderChangeToAsc: 'Изменить сортировку на возрастающую',
        orderChangeToDesc: 'Изменить сортировку на убывающую',
    },
    sessions: {
        invalidateAll: 'Аннулировать все сессии',
    },
    tabs: {
        config: 'Конфигурация',
        delete: 'Удаление',
    },
    tos: {
        accepted: 'Принято',
        addNewToS: 'Новые условия',
        addNewToSFromCurrent: 'Новые условия на основе выбранных',
        added: 'Добавлено',
        checkStatus: 'Проверить статус пользователя',
        immutable: `ВНИМАНИЕ: После добавления новых Условий использования они являются неизменяемыми и не могут быть
			удалены!`,
        noneExist: 'Условия использования ещё не были добавлены.',
        optUntil: {
            desc: `В течение переходного периода принятие обновлённых условий является необязательным. Оно становится
				обязательным только после его окончания.`,
            enable: 'Включить переходный период',
            label: 'Окончание переходного периода',
        },
        tos: 'Условия',
    },
    users: {
        antiLockout: {
            rule: 'Правило защиты от блокировки',
            delete: 'нельзя удалить',
            disable: 'нельзя отключить',
            rauthyAdmin: 'правило rauthy_admin нельзя удалить',
        },
        attributes: 'Атрибуты',
        deleteUser: 'Вы уверены, что хотите удалить этого пользователя?',
        descAttr: `Установите пользовательские атрибуты. Все пары ключ/значение обрабатываются как Строка / JSON-значение.`,
        forceLogout: `Вы уверены, что хотите аннулировать все существующие сессии и удалить все токены обновления
            для этого пользователя?`,
        lastLogin: 'Последний вход',
        manualInitDesc: `Пользователь также может быть инициализирован здесь. В этом случае, однако, вам нужно сообщить пароль
            напрямую.`,
        manualInit: 'Ручная инициализация',
        mfaDelete1: 'Вы можете удалить ключи доступа для этого пользователя.',
        mfaDelete2: `Внимание! Удаление ключа доступа <b>нельзя отменить</b> без полной повторной
            регистрации пользователем.`,
        noMfaKeys: 'У этого пользователя нет зарегистрированных ключей доступа.',
        pkOnly1: 'Это аккаунт только с ключом доступа.',
        pkOnly2:
            'Это означает, что этот пользователь использует вход без пароля и не имеет установленного пароля.',
        pkOnly3: `Если этот пользователь потерял все ключи доступа, аккаунт можно полностью сбросить и отправить новое
            письмо для сброса пароля. Для этого перейдите на вкладку 'MFA' и удалите все существующие ключи доступа.`,
        pwdNoInit: 'Пользователь ещё не выполнил начальный сброс пароля.',
        pwdSendEmailBtn: 'Отправить письмо для сброса',
        pwdSendEmailDesc:
            'Вы можете отправить новое письмо для сброса, если пользователь его не получил.',
        savePassword: 'Сохранить пароль',
        selfServiceDesc:
            'Вы можете либо установить новый пароль, либо отправить письмо для сброса.',
        sendResetEmail: 'Отправить письмо для сброса',
    },
    validation: {
        css: 'Недопустимое CSS-значение',
        origin: 'Недопустимый источник',
        uri: 'Недопустимый URI',
    },
};
